app/controllers/api/authors_controller.rb

SELECT  "authors".* FROM "authors"  WHERE "authors"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "books".* FROM "books"  WHERE "books"."author_id" IN (1)
---
  def show
    @author = Author.includes(:books).find(params[:id])