app/controllers/api/books_controller.rb

SELECT  "books".* FROM "books"  WHERE "books"."id" = $1 LIMIT 1  [["id", 4]]
SELECT "shelved_books".* FROM "shelved_books"  WHERE "shelved_books"."book_id" = $1  [["book_id", 5]]
---
  def show
    @book = Book.includes(:shelved_books).find(params[:id])