app/controllers/api/friendships_controller.rb

  def create

    friendship = Friendship.new({
      user_id: current_user.id,
      friend_id: params[:friend_id]
    })

    inverse_friendship = Friendship.new({
      user_id: params[:friend_id],
      friend_id: current_user.id
    })

    inverse_friendship.set_activation_token

    success = true
    Friendship.transaction do
      success = friendship.save
---
INSERT INTO "friendships" ("activation_token", "created_at", "friend_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["activation_token", "WAPEuv-Gt2pz3A5-OPNnKA"], ["created_at", "2015-01-09 21:44:27.756885"], ["friend_id", 1], ["updated_at", "2015-01-09 21:44:27.756885"], ["user_id", 2]]

  def destroy
    friendship = Friendship.find_by(friend_id: params[:friend_id], user_id: current_user.id)
    inv_friendship = Friendship.find_by(friend_id: current_user.id, user_id: params[:friend_id])

    success = true
    Friendship.transaction do
      success = friendship.destroy
---
SELECT  "friendships".* FROM "friendships"  WHERE "friendships"."friend_id" = 2 AND "friendships"."user_id" = 1 LIMIT 1
DELETE FROM "friendships" WHERE "friendships"."id" = $1  [["id", 5]]