app/controllers/api/users_controller.rb

  def show
    @user = User.includes(:friendships, :books, :shelves, :reviews, :ratings).find(params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "friendships".* FROM "friendships"  WHERE "friendships"."user_id" IN (1)