app/views/users/show.html.erb

    <br>
    <% @user.friendship_requests.each do |friendship| %>
---
SELECT "friendships".* FROM "friendships"  WHERE "friendships"."user_id" = $1 AND ('t')  [["user_id", 6]]

  <h2><strong>Your Books</h2></strong>
  <% @user.books && @user.books.each do |book| %>
---
SELECT "books".* FROM "books" INNER JOIN "shelved_books" ON "books"."id" = "shelved_books"."book_id" INNER JOIN "shelves" ON "shelved_books"."shelf_id" = "shelves"."id" WHERE "shelves"."user_id" = $1  [["user_id", 1]]