app/controllers/books_controller.rb

SELECT  "books".* FROM "books"  WHERE "books"."isbn" = '1430218150' LIMIT 1
INSERT INTO "books" ("author_id", "cover", "created_at", "description", "isbn", "submitter_id", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @book = Book.find_by_isbn(params[:book][:isbn])

    if !@book
      @book = Book.new
      # @book.errors.messages[:isbn] = ["Please enter a valid ISBN10"]
      render :new
    elsif @book.save

SELECT  "books".* FROM "books"  WHERE "books"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "authors".* FROM "authors"  WHERE "authors"."id" = $1 LIMIT 1  [["id", 3]]
---
  def show
    @book = Book.find(params[:id])
    @author = Author.find(@book.author_id)