app/controllers/friendship_activations_controller.rb

  def edit
    friendship = Friendship.find_by({user_id: current_user.id})
---
SELECT  "friendships".* FROM "friendships"  WHERE "friendships"."user_id" = 3 AND "friendships"."friend_id" = 2 LIMIT 1