app/controllers/friendships_controller.rb

INSERT INTO "friendships" ("activation_token", "created_at", "friend_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["activation_token", "yin6gxeXxP5C4N9zxn2vGA"], ["created_at", "2015-01-08 17:33:21.765651"], ["friend_id", 2], ["updated_at", "2015-01-08 17:33:21.765651"], ["user_id", 1]]
---
  def create
    friendship = Friendship.new({
      user_id: current_user.id,
      friend_id: params[:friendship][:friend_id]
    })

    inverse_friendship = Friendship.new({
      user_id: params[:friendship][:friend_id],
      friend_id: current_user.id
    })

    inverse_friendship.set_activation_token

    success = true
    Friendship.transaction do
      success = friendship.save