app/controllers/shelved_books_controller.rb

SELECT  "shelves".* FROM "shelves"  WHERE "shelves"."user_id" = $1  ORDER BY "shelves"."id" ASC LIMIT 1  [["user_id", 1]]
---
  def create
    shelf = current_user.shelves.first