app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "session_token", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def show
    @user = User.includes(:friends).find(params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]